[
    {
        "id": 101,
        "name": "Safari",
        "icon": "https://i.ibb.co/zNqX3hh/nav-icon-safari-b4hes9xilhjm-large.jpg",
        "desc": "Safari has innovative features that let you enjoy more of the web. In even more ways. Built-in privacy features help protect your information and keep your Mac secure. An updated start page helps you easily and quickly save, find, and share your favorite sites. And Siri suggestions surface bookmarks, links from your reading list, iCloud Tabs, links you receive in Messages, and more.",
        "img": "https://i.ibb.co/FKYSvf4/bia-safari-gns2a0avylyu-large-1.jpg"
      },
    {
        "id": 102,
        "name": "Photos",
        "icon": "https://i.ibb.co/gtT6tWP/nav-icon-photos-f2izri0oyzee-large.jpg",
        "desc": "Keep your growing library organized and accessible. Perfect your images and create beautiful gifts for sharing. And with iCloud Photos, you can store a lifetime’s worth of photos and videos in the cloud.",
        "img": "https://i.ibb.co/d0r3NCQ/bia-photos-cz11vic5lncm-large.jpg"
      },
    {
        "id": 103,
        "name": "iMovie",
        "icon": "https://i.ibb.co/J5nYPvF/nav-icon-imovie-b0pjfv6j5w9y-large.jpg",
        "desc": "Tell stories like never before. A simple design and intuitive editing features make it easy to create beautiful 4K movies and Hollywood-style trailers.",
        "img": "https://i.ibb.co/q9ZXXsJ/bia-imovie-eufhd8vcyo02-large.jpg"
      },
    {
        "id": 104,
        "name": "GarageBand",
        "icon": "https://i.ibb.co/5RHQZmn/nav-icon-garageband-cxmciudp6k02-large.jpg",
        "desc": "The easiest way to create great-sounding songs on your Mac. With an intuitive interface and access to a complete sound library, it’s never been easier to learn, play, record, and share music like a pro.",
        "img": "https://i.ibb.co/tq6NxHd/bia-garageband-cdjv7ykdtimq-large.jpg"
      },
    {
        "id": 105,
        "name": "Pages",
        "icon": "https://i.ibb.co/0sqqT2W/nav-icon-pages-ci5gjd3xa5si-large.jpg",
        "desc": "This powerful word processor gives you everything you need to create documents that look beautiful. And read beautifully. It lets you work seamlessly between Mac, iOS, and iPadOS devices. And work effortlessly with people who use Microsoft Word.",
        "img": "https://i.ibb.co/ZNQddKJ/bia-pages-v70unua3zgiy-large.jpg"
      },
    {
        "id": 106,
        "name": "Numbers",
        "icon": "https://i.ibb.co/8B3ZyKh/nav-icon-numbers-e9eog351v3iy-large.jpg",
        "desc": "Create sophisticated spreadsheets with dramatic interactive charts, tables, and images that paint a revealing picture of your data. Work seamlessly between Mac, iOS, and iPadOS devices. And work effortlessly with people who use Microsoft Excel.",
        "img": "https://i.ibb.co/tzyVH6B/bia-numbers-fto87hwyhliu-large.jpg"
      },
    {
        "id": 107,
        "name": "KeyNote",
        "icon":"https://i.ibb.co/cLWzCry/nav-icon-keynote-e5b6yp23dx2e-large.jpg",
        "desc": "Bring your ideas to life with beautiful presentations. Employ powerful tools and dazzling effects that keep your audience engaged. Work seamlessly between Mac, iOS, and iPadOS devices. And work effortlessly with people who use Microsoft PowerPoint.",
        "img": "https://i.ibb.co/sWXgGQn/bia-keynote-bmh51wz81auq-large.jpg"
      }
]