[
    {
        "id": 101,
        "name": "Ehsan Fayez",
        "rating": 3.5, 
        "review": "The 2022 hop-up of the 13-inch MacBook Pro (starting at $1,299, $1,899 as tested) brings a big silicon deal for power users to the stalwart MacBook: It's the first to hit the market with Apple's new M2 processor. In classic Apple fashion, it’s a stylish and capable laptop that can hang with the best in the ultraportable class.",
        "img": "https://images.unsplash.com/photo-1568602471122-7832951cc4c5?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80"
      },
    {
        "id": 102,
        "name": "Iyad Jamil",
        "rating": 5,
        "review": " Apple MackBooks with the first manifestation we've seen of the second-generation Apple Silicon-based processor line (the plain 'M2,' in contrast to previous-generation variants like the 'M1 Max'), the MacBook Pro 13-inch is marked as much by what doesn’t change as what does. The new CPU may offer enhanced performance.",
        "img": "https://images.unsplash.com/photo-1564564321837-a57b7070ac4f?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=876&q=80"
      },
    {
        "id": 103,
        "name": "Qasim Marwan",
        "rating": 4,
        "review": "Now, of course, Apple offers several configurations of the new 13-inch MacBook Pro. Our own review unit was stepped up from the base model, outfitted with more memory (16GB) and storage (1TB), and decked out in Space Gray. This configuration sells for $1,899. The base model is a bit more modest, with the same Apple M2 eight-core.",
        "img": "https://images.unsplash.com/photo-1539571696357-5a69c17a67c6?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=387&q=80"
      },
    {
        "id": 104,
        "name": "Salman Sami",
        "rating": 4.5,
        "review": "If you really want to splash out on the 13-inch Pro, the best configuration ($2,499) tops out at 24GB of memory and a 2TB drive. Whether that’s worth the extra spend pivots on your memory and storage needs. If you know you'll be working with memory-intensive apps or need the maximum possible local storage for media work.",
        "img": "https://images.unsplash.com/photo-1560250097-0b93528c311a?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=387&q=80"
      },
    {
        "id": 105,
        "name": "Wafi Mansour",
        "rating": 4,
        "review": "Comparing Apple’s macOS laptops to Intel-powered Windows ones isn’t entirely straightforward, as the latest nuances of the long-running Mac and PC bifurcation makes finding meaningfully overlapping tests a bit of a challenge. Apps that run just fine on scads of Windows machines may not have native support on Apple Silicon.",
        "img": "https://images.unsplash.com/photo-1566753323558-f4e0952af115?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=721&q=80"
      },
    {
        "id": 106,
        "name": "Adnan Saqi",
        "rating": 5,
        "review": "While the cross-platform tests aren’t as numerous as we’d like, we still have plenty to compare. Video transcoding in Handbrake is one such test, timing how long it takes a machine to convert a standard 4K clip into a smaller 1080p version.We also use Cinebench R23, which uses Maxon’s Cinema 4D engine to render a complex scene.",
        "img": "https://images.unsplash.com/photo-1615109398623-88346a601842?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=387&q=80"
      }
]